import { BannerBlock } from "@/shared/components";

const bannerSlider = [
  {
    desktop: "/assets/main_partner_ua_0.jpg",
    mobile: "/assets/partner_mob_ua_0.jpg",
  },
  {
    desktop: "/assets/main_partner_ua_1.png",
    mobile: "/assets/partner_mob_ua_1.png",
  },
];

const partner=[
    {img:"/blog/partner1.jpeg",title:"Корочанська Інна Вікторівна",info:"Власниця магазину 'ESTET' м.Марганець",text:" Дякуємо Інні за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    {img:"/blog/1.png",title:"Бондаренко Олена Миколаївна",info:"Власниця магазину 'ELITE' м.Київ",text:" Дякуємо Олені за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    {img:"/blog/2.jpeg",title:"Кваченко Олександр Олександрович",info:"Власник мережі магазинів 'ALEX' м.Дніпро",text:" Дякуємо Олександру за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    {img:"/blog/3.webp",title:"Кузьменко Марина Володимирівна",info:"Власниця магазину 'MARTA' м.Одеса",text:" Дякуємо Марині за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    {img:"/blog/4.webp",title:"Мельник Олексій Олександрович",info:"Власник мережі магазинів 'ALEX' м.Київ",text:" Дякуємо Олександру за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    {img:"/blog/5.webp",title:"Олейник Олексій Олександрович",info:"Власник мережі магазинів 'OLEX' м.Львів",text:" Дякуємо Олександру за співпрацю!А також просимо вас розширятися  та працювати з нами,бо ми знаємо що у вас є можливість для будування нового магазину не затягуйте з цим.  Ми раді працювати з таким надійним партнером, який цінує якість і стиль. Разом ми створюємо неповторний досвід для наших клієнтів."},
    
]

const PartnerPage = () => {
  return (
    <div>
      <BannerBlock bannerSlider={bannerSlider} />
      <div className="p-4">
        <h1 className="text-4xl font-bold mb-4">Партнерам</h1>
        <p className="mb-4">
          Ласкаво просимо до розділу для партнерів AVECS! Ми цінуємо співпрацю з
          вами і прагнемо створити взаємовигідні відносини. Тут ви знайдете всю
          необхідну інформацію про те, як стати нашим партнером, а також про
          переваги співпраці з нами.
        </p>
        <h2 className="text-2xl font-semibold mb-2">Чому обрати AVECS?</h2>
        <ul className="list-disc list-inside mb-4">
          <li>Високий рівень якості продукту</li>
          <li>Гарантія якості</li>
          <li>Підтримка клієнтів</li>
        </ul>
        <h2 className="text-4xl font-bold mb-4" >НАМ ДОВІРЯЮТЬ</h2>
        <div className="grid grid-cols-4 gap-4 mb-8 max-lg:grid-cols-1">
        {partner.map((p)=>
            <div key={p.title} className="mb-8 border p-4 rounded-lg shadow-md bg-gray-100" >
                <div className="flex items-center mb-4">
                    <img src={p.img} alt={p.title} className="w-32 h-32 object-cover  mr-4" />
                    <div>
                        <h3 className="text-xl font-semibold">{p.title}</h3>
                        <p className="text-gray-600">{p.info}</p>
                    </div>
                </div>
                <p>{p.text}</p>
            </div>
        )}
        </div>
      </div>
    </div>
  );
};

export default PartnerPage;
